kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_5_2/ESP32-S3-Station-V_7_5_2.ino
  uint8_t df = safeDropFactor(dropFactor);
  if (hasFirstDropOccurred && !skipNextInterval) {
    unsigned long dropDeltaMs = eventMs - lastDropTimestamp;
    if (dropDeltaMs > minDropInterval && dropDeltaMs < MAX_OCCLUSION_MS) {
      float instantGttMin   = 60000.0f / (float)dropDeltaMs;
      float instantRateMlHr = (instantGttMin * 60.0f) / (float)df;
      if (currentFlowRate_ml_hr == 0.0f) currentFlowRate_ml_hr = instantRateMlHr;
      else currentFlowRate_ml_hr = (instantRateMlHr * 0.75f) + (currentFlowRate_ml_hr * 0.25f);
    }
  }
  hasFirstDropOccurred = true;
  skipNextInterval = false;
  lastDropTimestamp = eventMs;
  currentGttMin = (currentFlowRate_ml_hr * (float)df) / 60.0f;
  totalVolumeMl = (float)totalDrops / (float)df;
}

// อ่านเซนเซอร์ 1 ครั้งตามคาบที่กำหนด แล้วเดินเครื่องจักรสถานะ
// countDrops = false ใช้ตอนคาลิเบรต/หยุดชั่วคราว (ยังอัปเดตเส้นฐานและสัญญาณรบกวนตามปกติ)
// คืนค่า true เมื่อเพิ่ง "จบพัลส์ที่ผ่านเกณฑ์" ในรอบนี้
bool serviceDropSensor(bool countDrops) {
  uint32_t nowUs = micros();
  uint32_t dtUs  = nowUs - lastSampleUs;
  if (dtUs < SENSOR_SAMPLE_US) return false;
  lastSampleUs = nowUs;

  sensorRaw = analogRead(SENSOR_AO_PIN);

  if (!sensorReady) { resetSignalChain(sensorRaw); return false; }

  // อ่านขาดช่วงนาน (เช่นเพิ่งวาดจอทั้งหน้า) — ทิ้งเฉพาะพัลส์ที่กำลังดำเนินอยู่ เพราะมองเห็นไม่ครบ
  // แต่ต้อง "เก็บเส้นฐานเดิมไว้" เพราะเป็นค่าที่สะสมมานาน ถ้าตั้งต้นใหม่ทุกครั้งที่วาดจอ
  // ตัวตรวจจับจะถูกดีดกลับไปเฟสรอนิ่งเรื่อย ๆ จนแทบไม่มีจังหวะเฝ้ารอหยดเลย
  if (dtUs > (uint32_t)SENSOR_GAP_RESYNC_MS * 1000UL) {
    for (int i = 0; i < SENSOR_MEDIAN_N; i++) medBuf[i] = sensorRaw;
    sensorFiltered = sensorRaw;
    if (dropPhase == DP_ACTIVE) rejectedPulses++;
    dropPhase = DP_REARM;
    dropPhaseMs = millis();
    dropSettleMs = dropPhaseMs;
    sampleGaps++;
    return false;
  }

  sensorFiltered = pushMedian(sensorRaw);
  sensorBaseline = (int)(baselineAcc / 256);
  sensorDelta    = deltaFromBaseline(sensorFiltered);

  // อัตราการไล่ตามคิดจากเวลาที่ผ่านไปจริง (หน่วย 100 us) ไม่ใช่จำนวนตัวอย่าง
  long tick = (long)(dtUs / 100);
  if (tick < 1)   tick = 1;
  if (tick > 200) tick = 200;

  // แยก "ส่วนที่ไต่ขึ้นเร็ว" ออกจาก "ส่วนที่ค่อย ๆ เลื่อน"
  // ถุงน้ำเกลือแกว่งตอนคนไข้เดินทำให้สัญญาณส่ายเป็นจังหวะหลายร้อยมิลลิวินาที
  // ตัวตามช้าจะไล่ตามส่วนนั้นได้ทัน แล้วหักออกจนเหลือศูนย์
  // ส่วนหยดที่กว้างแค่ราว 10 ms ตัวตามช้าตามไม่ทัน จึงเหลือเป็นยอดแหลมให้จับ
  // (หยุดไล่ตามระหว่างที่พัลส์กำลังดำเนินอยู่ ไม่งั้นจะกลืนหยดหายไปเอง)
  if (dropPhase != DP_ACTIVE) {
    long tau = inMotion ? DELTA_SLOW_TAU_MOTION : DELTA_SLOW_TAU;
    deltaSlowAcc += ((long)sensorDelta * 256 - deltaSlowAcc) * tick / tau;
  }
  deltaSlow = (int)(deltaSlowAcc / 256);
  deltaEdge = sensorDelta - deltaSlow;

  unsigned long nowMs = millis();
  bool completed = false;

  // เส้นฐานไล่ตามการดริฟต์ (อุณหภูมิ/แสงรอบข้าง/แรงดันไฟ)
  // ต้องไล่ตามทั้งในเฟสเฝ้าดูและเฟสรอนิ่ง หยุดเฉพาะตอนที่พัลส์กำลังดำเนินอยู่เท่านั้น
  // (ถ้าหยุดตามในเฟสรอนิ่งด้วย ระดับที่ไหลไปเรื่อย ๆ จะดันให้ค้างอยู่ในเฟสนั้นตลอดไป)
  // ถุงน้ำเกลือแกว่งตอนคนไข้เดิน = เส้นฐานเคลื่อนเป็นช่วง ๆ ตรวจไว้เพื่อไล่ตามให้ทัน
  if (nowMs - motionCheckMs >= MOTION_WINDOW_MS) {
    motionLevel = abs(sensorBaseline - baselineRef);
    baselineRef = sensorBaseline;
    motionCheckMs = nowMs;
    int thr = (calNoisePp > 4) ? calNoisePp : 4;
    if (motionLevel > thr) motionUntil = nowMs + MOTION_HOLD_MS;
  }
  inMotion = (nowMs < motionUntil);

  if (dropPhase != DP_ACTIVE) {
    long tau = BASELINE_TAU;
    if (inMotion) tau = BASELINE_TAU_FAST;             // กำลังแกว่ง -> ไล่ตามเร็วขึ้น
    if (dropPhase == DP_REARM && deltaEdge > dropReleaseDelta)
      tau = BASELINE_TAU_FAST;                         // ค้างเหนือเกณฑ์ปลด -> ดึงกลับเร็วขึ้น
    baselineAcc += ((long)sensorFiltered * 256 - baselineAcc) * tick / tau;

    if (dropPhase == DP_IDLE && abs(deltaEdge) < dropTriggerDelta / 2) {  // วัดสัญญาณรบกวนจากช่วงที่สงบจริง ๆ
      if (sensorFiltered < noiseMin) noiseMin = sensorFiltered;
      if (sensorFiltered > noiseMax) noiseMax = sensorFiltered;
    }
    if (nowMs - noiseWindowStart >= NOISE_WINDOW_MS) {
      if (noiseMax >= noiseMin) sensorNoisePp = noiseMax - noiseMin;
      noiseMin = sensorFiltered; noiseMax = sensorFiltered;
      noiseWindowStart = nowMs;
    }
  }

  switch (dropPhase) {
    case DP_IDLE:
      if (deltaEdge >= dropTriggerDelta) {
        dropPhase = DP_ACTIVE;
        dropPhaseMs = nowMs;
        dropPeakDelta = deltaEdge;
        dropRiseMs = 0;
      }
      break;

    case DP_ACTIVE: {
      if (deltaEdge > dropPeakDelta) {
        dropPeakDelta = deltaEdge;
        dropRiseMs = nowMs - dropPhaseMs;      // ยอดใหม่ -> ขอบขาขึ้นยังไต่อยู่
      }
      unsigned long width = nowMs - dropPhaseMs;

      if (deltaEdge <= dropReleaseDelta) {
        // พัลส์จบ -> ตัดสินใจ "ที่เดียว" จึงนับได้ไม่เกิน 1 ครั้งต่อ 1 พัลส์
        if (pulseLooksLikeDrop(dropPeakDelta, (int)width, (int)dropRiseMs)) {
          lastDropPeak    = dropPeakDelta;
          lastDropWidthMs = (int)width;
          lastDropRiseMs  = (int)dropRiseMs;
          completed = true;
          completedPulses++;
          learnFromPulse(dropPeakDelta, (int)width);
          if (countDrops) registerDrop(dropPhaseMs);
        } else {
          rejectedPulses++;                 // รูปร่างไม่ใช่หยด (รบกวน/ถุงแกว่ง/สิ่งบังลำแสง)
        }
        dropPhase = DP_REARM;
        dropPhaseMs = nowMs;
        dropSettleMs = nowMs;
      }
      else if (width > DROP_MAX_WIDTH_MS) {
        // ค้างนานผิดปกติ = ไม่ใช่หยด (ระดับน้ำเปลี่ยน / มีอะไรบังลำแสง)
        rejectedPulses++;
        dropPhase = DP_REARM;
        dropPhaseMs = nowMs;
        dropSettleMs = nowMs;
      }
      break;
    }

    case DP_REARM:
      // ต้องกลับมานิ่งใต้เกณฑ์ปลดต่อเนื่องครบเวลา จึงจะรับพัลส์ถัดไป
      // นี่คือส่วนที่ทำให้ "กดสวิตช์แล้วลั่น" หายไป
      if (deltaEdge > dropReleaseDelta) {
        dropSettleMs = nowMs;                          // ยังไม่นิ่ง เริ่มจับเวลานิ่งใหม่
      } else if (nowMs - dropSettleMs >= DROP_REARM_MS) {
        dropPhase = DP_IDLE;
      }

      // ทางออกกันค้าง: ถ้าอยู่ในเฟสนี้นานเกินไปแปลว่าระดับสัญญาณเลื่อนไปจริง ๆ
      // (เซนเซอร์ขยับ ไฟตก แสงรอบข้างเปลี่ยน หรือเส้นฐานตอนเริ่มเพี้ยน)
      // ถ้าไม่ยึดเส้นฐานใหม่ตรงนี้ เครื่องจะค้างอยู่ในเฟสนี้ตลอดไปและจะไม่นับหยดอีกเลย
      if (nowMs - dropPhaseMs >= DROP_REARM_TIMEOUT_MS) {
        baselineAcc = (long)sensorFiltered * 256;
        sensorBaseline = sensorFiltered;
        sensorDelta = 0;
        dropPhase = DP_IDLE;
        baselineRecovers++;
      }
      break;
  }

  return completed;
}

// ============================================================================
// จอออสซิลโลสโคปเล็ก ๆ สำหรับหน้าคาลิเบรต
// แสดง "ระยะเบนจากเส้นฐาน" ตามเวลา จึงเห็นชัดว่าอันไหนคือหยด อันไหนคือช่วงว่าง
// ============================================================================
#define SCOPE_X            7
#define SCOPE_W            158
#define SCOPE_H            72
#define SCOPE_MS_PER_COL   16          // 1 คอลัมน์ = 16 ms -> เห็นย้อนหลัง ~2.5 วินาที

