kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_5_2/ESP32-S3-Station-V_7_5_2.ino
    if (calButtonPressed()) { calWaitRelease(); scopeFixedFull = 0; return false; }

    if (millis() - lastDraw >= 150) {
      lastDraw = millis();
      scopeDraw(SCOPE_TOP);
      int pct = (int)((millis() - start) * 100 / CAL_NOISE_MS);
      tft.drawRect(12, 170, 148, 10, UI_LINE);
      tft.fillRect(13, 171, 146 * pct / 100, 8, THEME_CYAN);
      calRow(190, "BASELINE", String(sensorBaseline), COLOR_WHITE);
      calRow(208, "NOISE pp", String(wMax - wMin) + " adc", COLOR_WHITE);
      calRow(226, "LIVE", String(sensorFiltered), THEME_SKYBLUE);
    }
    calServiceBeep();
    delay(1);
  }

  scopeFixedFull = 0;
  calNoisePp = wMax - wMin;
  if (calNoisePp < 1) calNoisePp = 1;

  const char* verdict = (calNoisePp <= 20) ? "VERY QUIET"
                      : (calNoisePp <= 60) ? "OK"
                      : (calNoisePp <= 150) ? "NOISY - SHIELD IT"
                                            : "VERY NOISY";
  uint16_t vcol = (calNoisePp <= 60) ? COLOR_GREEN : (calNoisePp <= 150) ? COLOR_YELLOW : COLOR_RED;
  calRow(208, "NOISE pp", String(calNoisePp) + " adc", vcol);
  calRow(244, "RESULT", String(verdict), vcol);
  modalSafeBeep(2000, 60);
  delay(900);
  return true;
}

// ============================================================================
// ขั้นที่ 2 — เรียนรู้จากหยดจริง
// จับพัลส์จริงด้วยเกณฑ์ไวชั่วคราว (4 เท่าของสัญญาณรบกวน) แล้วเก็บความสูง/ความกว้าง
// พร้อมเดาทิศของสัญญาณให้เอง (หยดทำให้ค่าลดลงหรือเพิ่มขึ้น)
// ============================================================================
bool calStepLearn() {
  calHeader("STEP 2 OF 3   DROPS", "LET IT DRIP NOW", "aim beam below nozzle");
  drawCenteredString("CLICK = DONE", 296, 1, UI_DIM, THEME_BG);
  scopeReset();
  calCount = 0;

  int probe = calNoisePp * 4;
  if (probe < CAL_MIN_TRIGGER) probe = CAL_MIN_TRIGGER;
  dropTriggerDelta = probe;
  dropReleaseDelta = probe * 2 / 5;
  if (dropReleaseDelta < 2) dropReleaseDelta = 2;

  // ระหว่างขั้นนี้ให้รับพัลส์ทุกแบบก่อน เพราะยังไม่รู้ว่าหยดหน้าตาอย่างไร
  learnAmp = 0; learnWidth = 0;
  shapeGateEnabled = false;

  // ---- เดาทิศสัญญาณ: ดูว่าค่าเบนออกจากเส้นฐานไปทางไหนแรงกว่ากัน ----
  dropPolarity = -1;
  resetSignalChain(readSensorAverage(16));
  int excDown = 0, excUp = 0;
  unsigned long polStart = millis();
  unsigned long lastDraw = 0;
  bool polarityLocked = false;

  while (!polarityLocked && millis() - polStart < CAL_POLARITY_MS) {
    if (serviceDropSensor(false)) { }
    int d = sensorBaseline - sensorFiltered;
    if (d > excDown) excDown = d;
    if (-d > excUp) excUp = -d;
    if (excDown >= probe || excUp >= probe) polarityLocked = true;
    if (calButtonPressed()) { calWaitRelease(); return false; }
    if (millis() - lastDraw >= 120) {
      lastDraw = millis();
      calRow(172, "SIGNAL", "watching...", THEME_SKYBLUE);
      calRow(190, "DOWN/UP", String(excDown) + " / " + String(excUp), COLOR_WHITE);
    }
    calServiceBeep();
    delay(1);
  }
  if (excUp > excDown) dropPolarity = 1;
  resetSignalChain(readSensorAverage(16));
  scopeReset();
  calRow(172, "SIGNAL", (dropPolarity < 0) ? "drop = LOWER" : "drop = HIGHER", COLOR_WHITE);

  // ---- เก็บพัลส์จริง ----
  unsigned long start = millis();
  lastDraw = 0;
  uint32_t seenPulses = completedPulses;
  while (calCount < CAL_TARGET_DROPS && millis() - start < CAL_LEARN_TIMEOUT_MS) {
    serviceDropSensor(false);
    // อ่านจากตัวนับ ไม่ใช่ค่าที่ฟังก์ชันคืนมา เพราะพัลส์อาจจบระหว่างที่กำลังวาดกราฟอยู่
    if (completedPulses != seenPulses) {
      seenPulses = completedPulses;
      if (calCount < CAL_MAX_SAMPLES) {
        calPeaks[calCount]  = lastDropPeak;
        calWidths[calCount] = lastDropWidthMs;
        calCount++;
        calBeep(2600, 25);
      }
    }
    // ได้หยดพอประมาณและความสูงใกล้เคียงกันแล้ว = รู้จักหยดแล้ว ไม่ต้องรอให้ครบ
    if (calCount >= CAL_QUICK_DROPS) {
      int mn = calMinOf(calPeaks, calCount), mx = calMaxOf(calPeaks, calCount);
      if (mx > 0 && (mx - mn) * 100 / mx <= CAL_QUICK_SPREAD_PCT) break;
    }
    scopePush(deltaEdge);   // แสดงสัญญาณเดียวกับที่ตัวตรวจจับใช้ตัดสิน

    if (calButtonPressed()) { calWaitRelease(); break; }

    if (millis() - lastDraw >= 150) {
      lastDraw = millis();
      scopeDraw(SCOPE_TOP);
      calRow(190, "DROPS", String(calCount) + " / " + String(CAL_TARGET_DROPS),
             (calCount >= CAL_MIN_DROPS) ? COLOR_GREEN : COLOR_YELLOW);
      calRow(208, "LAST PK", String(lastDropPeak) + " adc", COLOR_WHITE);
      calRow(226, "LAST W", String(lastDropWidthMs) + " ms", COLOR_WHITE);
      calRow(244, "REJECT", String(rejectedPulses) + " RE " + String(baselineRecovers) +
                            " GAP " + String(sampleGaps),
             (rejectedPulses || baselineRecovers) ? COLOR_ORANGE : UI_DIM);
      const char* ph = (dropPhase == DP_IDLE) ? "WATCH" : (dropPhase == DP_ACTIVE) ? "PULSE" : "SETTLE";
      calRow(262, ph, String(deltaEdge) + " / " + String(dropTriggerDelta) +
             (inMotion ? "  MOVE" : ""), THEME_SKYBLUE);
    }
    calServiceBeep();
    delay(1);
  }

  shapeGateEnabled = true;
  if (calCount < CAL_MIN_DROPS) {
    calRow(262, "RESULT", "NOT ENOUGH DROPS", COLOR_RED);
    modalSafeBeep(700, 250);
    delay(1600);
    return false;
  }
  modalSafeBeep(2200, 80);
  return true;
}

// ============================================================================
// ขั้นที่ 3 — คำนวณเกณฑ์ที่ดีที่สุดระหว่าง "พ้นสัญญาณรบกวน" กับ "ต่ำกว่าหยดที่จางที่สุด"
// แล้วรายงานอัตราส่วนสัญญาณต่อสัญญาณรบกวน (SNR) ให้เห็นขีดความสามารถจริงของเซ็นเซอร์
// ============================================================================
void calFinish() {
  int medPeak  = calMedian(calPeaks, calCount);
  int maxPeak  = calMaxOf(calPeaks, calCount);
  int medWidth = calMedian(calWidths, calCount);

  // หา "หยดที่จางที่สุดที่ยังน่าเชื่อถือ" โดยตัดพัลส์ที่ต่ำกว่าครึ่งหนึ่งของค่ากลางทิ้ง
  // (พัลส์เตี้ยผิดปกติมักเกิดจากจังหวะที่การอ่านขาดช่วงไปตอนวาดจอ ไม่ใช่หยดที่จางจริง)
  int minPeak = medPeak;
  for (int i = 0; i < calCount; i++)
    if (calPeaks[i] >= medPeak / 2 && calPeaks[i] < minPeak) minPeak = calPeaks[i];

