kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_5_2/ESP32-S3-Station-V_7_5_2.ino
  int rate = isRunning ? (int)(currentFlowRate_ml_hr + 0.5f) : -1;
  if (rate != cacheRate) {
    cacheRate = rate;
    tft.fillRect(6, 180, 160, 44, THEME_BG);
    drawCenteredString(rate >= 0 ? String(rate) : String("--"), 182, 5,
                       (st == UI_NOFLOW) ? COLOR_RED : COLOR_WHITE, THEME_BG);
  }
}

// ============================================================================
// หน้าผู้พัฒนา / หน้าตั้งหมายเลขเตียง
// ============================================================================
void drawDeveloperCreditScreen() {
  tft.fillScreen(THEME_BG);
  tft.fillRoundRect(6, 16, 160, 34, 6, THEME_PINK);
  drawCenteredString("SMART IV ALERT", 26, 2, THEME_BG, THEME_PINK);

  drawCenteredString("Bed Station Node", 66, 1, UI_DIM, THEME_BG);
  drawCenteredString("FW v" APP_VERSION, 82, 1, THEME_SKYBLUE, THEME_BG);

  tft.fillRoundRect(6, 106, 160, 96, 8, UI_CARD);
  drawCenteredString("DEVELOPER", 114, 1, UI_DIM, UI_CARD);
  drawCenteredString("Kittiphan", 132, 2, COLOR_YELLOW, UI_CARD);
  drawCenteredString("Rattanakorn", 154, 2, COLOR_YELLOW, UI_CARD);
  drawCenteredString("MCU Phrae Campus", 180, 1, UI_DIM, UI_CARD);

  tft.fillRoundRect(6, 212, 160, 60, 8, UI_CARD);
  drawCenteredString("BCN Phrae Innovation", 224, 1, THEME_CYAN, UI_CARD);
  drawCenteredString("Suk Mean Hospital Trial", 244, 1, UI_DIM, UI_CARD);

  drawCenteredString("CLICK TO RETURN", 296, 1, UI_DIM, THEME_BG);
  stateNeedsRedraw = false;
}

// ----------------------------------------------------------------------------
// ทิศการแสดงผลของจอ
// ----------------------------------------------------------------------------
// setRotation(0) กับ (2) เป็นแนวตั้ง 172x320 เหมือนกัน ต่างกันแค่บิต MX/MY ใน
// MADCTL พิกัดที่ใช้วาดทั้งไฟล์จึงไม่ต้องแก้ เพียงสั่งวาดหน้าเดิมซ้ำอีกครั้ง
void applyScreenRotation(uint8_t rot) {
  screenRotation = (rot == TFT_ROT_FLIP180) ? TFT_ROT_FLIP180 : TFT_ROT_NORMAL;
  tft.setRotation(screenRotation);
  tft.setTextWrap(false);
  tft.fillScreen(THEME_BG);
  stateNeedsRedraw = true;      // ให้ทุกหน้าวาดกรอบใหม่ทั้งหน้า (แคชถูกล้างในนั้น)
}

void saveScreenRotation() {
  stationPrefs.begin("st_cfg", false);
  stationPrefs.putUChar("rot", screenRotation);
  stationPrefs.end();
}

const char *screenRotationLabel() {
  return (screenRotation == TFT_ROT_FLIP180) ? "FLIP 180" : "NORMAL";
}

void drawStationIdConfigFramework() {
  tft.fillScreen(THEME_BG);
  tft.fillRoundRect(6, 16, 160, 34, 6, THEME_SKYBLUE);
  drawCenteredString("SET BED ID", 26, 2, THEME_BG, THEME_SKYBLUE);
  tft.fillRoundRect(6, 62, 160, 150, 8, UI_CARD);

  // แถวตั้งค่าทิศจอ — ช่วยให้ติดตั้งกล่องได้ทั้งแบบสาย USB ลงล่างและขึ้นบน
  tft.fillRoundRect(6, 220, 160, 42, 8, UI_CARD);
  drawCenteredString("SCREEN", 226, 1, UI_DIM, UI_CARD);
  drawCenteredString(padTo(screenRotationLabel(), 10), 240, 2, THEME_CYAN, UI_CARD);

  drawCenteredString("CLICK = BED 1-8", 272, 1, UI_DIM, THEME_BG);
  drawCenteredString("DBL CLICK = FLIP", 284, 1, UI_DIM, THEME_BG);
  cacheConfig = "";
  stateNeedsRedraw = false;
}

void updateStationIdConfigDynamic() {
  long msLeft = (long)configAutoSaveTimeout - (long)millis();
  int leftSec = (msLeft > 0) ? (int)(msLeft / 1000) + 1 : 0;
  String key = String(tempConfigStationId) + ":" + String(leftSec);
  if (key == cacheConfig) return;
  cacheConfig = key;

  tft.fillRect(40, 84, 92, 108, UI_CARD);
  drawCenteredString(String(tempConfigStationId), 90, 12, THEME_SKYBLUE, UI_CARD);
  drawCenteredString(padTo("SAVING IN " + String(leftSec) + "s", 16), 302, 1, COLOR_YELLOW, THEME_BG);
}

// ----------------------------------------------------------------------------
// ปุ่มกด
// ----------------------------------------------------------------------------
void handleButton() {
  static unsigned long btnPressStart = 0;
  static bool isHolding = false;
  static int clickCount = 0;
  static unsigned long lastReleaseTime = 0;

  bool reading = (digitalRead(BTN_PIN) == LOW);
  unsigned long now = millis();

  if (reading && !isHolding) {
    btnPressStart = now;
    isHolding = true;
    isHoldUiActive = false;
    holdBeep3sDone = false;
    holdBeep5sDone = false;
    lastUserActivityTime = now;
  }
  else if (reading && isHolding) {
    unsigned long holdDur = now - btnPressStart;
    if (holdDur >= 400 && currentState != STATE_CONFIG_ID) {
      isHoldUiActive = true;
      if (holdDur >= 3000 && !holdBeep3sDone) {
        beepNonBlocking(2200, 50);
        holdBeep3sDone = true;
      }
      if (holdDur >= 5000 && !holdBeep5sDone) {
        beepNonBlocking(2600, 80);
        holdBeep5sDone = true;
      }
      if (now - lastHoldRenderTime >= 35) {
        lastHoldRenderTime = now;
        drawHoldProgressHUD(holdDur);
      }
    }
  }
  else if (!reading && isHolding) {
    unsigned long pressDur = now - btnPressStart;
    isHolding = false;
    lastUserActivityTime = now;

    if (isHoldUiActive) {
      isHoldUiActive = false;
      clickCount = 0;
      if (pressDur >= 5000) {
        soundScreensaver();
        currentState = STATE_CREDIT;
        stateNeedsRedraw = true;
      } else if (pressDur >= 3000) {
        executeButtonCalibrationWizard();
      } else {
        soundClick();
        stateNeedsRedraw = true;
      }
      return;
    }
    else if (pressDur > 30 && pressDur < 400) {
      clickCount++;
      lastReleaseTime = now;
    }
  }

  if (clickCount > 0 && !isHolding && (now - lastReleaseTime > 280)) {
    int clicks = clickCount;
    clickCount = 0;

    if (currentState == STATE_CONFIG_ID) {
      soundClick();
      if (clicks >= 2) {
        // ดับเบิลคลิก = สลับจอกลับหัว 180 องศา เห็นผลทันที แล้วจำค่าไว้เลย
        applyScreenRotation(screenRotation == TFT_ROT_FLIP180 ? TFT_ROT_NORMAL
                                                              : TFT_ROT_FLIP180);
        saveScreenRotation();
      } else {
        tempConfigStationId = (tempConfigStationId % 8) + 1;
      }
      configAutoSaveTimeout = now + 4000;
      return;
    }

    if (currentState == STATE_EMERGENCY) {
      if (clicks >= 2) {
        togglePause();                         // หยุดนับ เช่น ขณะเปลี่ยนถุง/แก้สายพับ
      } else {
        snoozeUntilTime = now + SNOOZE_MS;
        noTone(BUZZER_PIN);
        buzzerBeepUntil = 0;
        soundClick();
      }
      currentState = STATE_NORMAL_VIEW;
      stateNeedsRedraw = true;
      return;
    }

    if (currentState == STATE_NEAR_END_NOTICE) {
      acknowledgeNearEnd();                    // คลิกกี่ครั้งก็ได้ = รับทราบ
      currentState = STATE_NORMAL_VIEW;
      currentNursePage = 1;
      stateNeedsRedraw = true;
      return;
    }

    if (currentState == STATE_CREDIT) {
      soundClick();
      currentState = STATE_NORMAL_VIEW;
      stateNeedsRedraw = true;
      return;
    }

    if (clicks >= 3) {
      soundClick();
      noTone(BUZZER_PIN);
      tempConfigStationId = currentStationId;
      configAutoSaveTimeout = now + 4000;
      currentState = STATE_CONFIG_ID;
      stateNeedsRedraw = true;
    }
    else if (clicks == 2) {
      togglePause();
      if (currentState == STATE_SCREENSAVER) currentState = STATE_NORMAL_VIEW;
    }
    else {
      soundClick();
      if (currentState == STATE_SCREENSAVER) {
        currentState = STATE_NORMAL_VIEW;
      } else {
        currentNursePage = (currentNursePage % 4) + 1;
      }
      stateNeedsRedraw = true;
    }
  }
}

// ----------------------------------------------------------------------------
// Setup
// ----------------------------------------------------------------------------
void setup() {
  Serial.begin(115200);

  setenv("TZ", "ICT-7", 1);
  tzset();

